AccumulationRegisters/ДенежныеСредстваКВыплате.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредстваКВыплате</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ХозяйственнаяОперация</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ЗаявкаНаРасходованиеДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.РаспоряжениеНаПеремещениеДенежныхСредств</v8:Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаНаРасходованиеДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БанковскийСчетКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчетаОрганизаций</v8:Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Получатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ЛимитыРасходаДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>ЛимитыРасходаДенежныхСредств</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Лимит</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасходВПределахЛимита</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасходСверхЛимита</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СтатьяДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Enums/СтатусыЗаявокНаРасходованиеДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Enum>
		<Properties>
			<Name>СтатусыЗаявокНаРасходованиеДенежныхСредств</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеСогласована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Согласована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КОплате</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ЛимитыРасходаДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ЛимитыРасходаДенежныхСредств</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЛимитыРасходаДенежныхСредств</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Лимиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СтатьяДвиженияДенежныхСредств</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиДвиженияДенежныхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕстьЛимит</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаЛюбогоЗнака</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Catalogs/СтатьиДвиженияДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>СтатьиДвиженияДенежныхСредств</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КорреспондирующийСчет</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>8</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидДвиженияДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДвиженийДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РеквизитДопУпорядочивания</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПриоритетОплаты</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПриоритетыОплаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ХозяйственныеОперации</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ХозяйственнаяОперация</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ХозяйственныеОперации</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ЛимитыРасходованияДенежныхСредствСервер/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

#Область Проведение

// Формирует параметры для проведения документа по регистрам учетного механизма через общий механизм проведения.
//
// Параметры:
//  Документ - ДокументОбъект - записываемый документ
//  Свойства - ФиксированнаяСтруктура - свойства документа (См. ПроведениеДокументов.СвойстваДокумента).
//
// Возвращаемое значение:
//  Структура - параметры учетного механизма (См. ПроведениеДокументов.ПараметрыУчетногоМеханизма()).
//
Функция ПараметрыДляПроведенияДокумента(Документ, Свойства) Экспорт
	
	Параметры = ПроведениеДокументов.ПараметрыУчетногоМеханизма();
	
	// Проведение
	Если Свойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		
		Параметры.ПодчиненныеРегистры.Добавить(Метаданные.РегистрыНакопления.ДенежныеСредстваКВыплате);
		Параметры.ПодчиненныеРегистры.Добавить(Метаданные.РегистрыНакопления.ЛимитыРасходаДенежныхСредств);
		
	КонецЕсли;
	
	// Контроль
	Если Свойства.РежимЗаписи <> РежимЗаписиДокумента.Запись Тогда
		
		Если Не Свойства.ЭтоНовый
			И (ТипЗнч(Документ) = Тип("ДокументОбъект.ЗаявкаНаРасходованиеДенежныхСредств")
				Или ТипЗнч(Документ) = Тип("ДокументОбъект.ПоступлениеБезналичныхДенежныхСредств")
					И ПолучитьФункциональнуюОпцию("ИспользоватьЗаявкиНаРасходованиеДенежныхСредств"))
		Или Свойства.РежимЗаписи = РежимЗаписиДокумента.Проведение
			И ((ТипЗнч(Документ) = Тип("ДокументОбъект.ОперацияПоПлатежнойКарте")
				Или ТипЗнч(Документ) = Тип("ДокументОбъект.РаспоряжениеНаПеремещениеДенежныхСредств")
				Или ТипЗнч(Документ) = Тип("ДокументОбъект.РасходныйКассовыйОрдер")
				Или ТипЗнч(Документ) = Тип("ДокументОбъект.СписаниеБезналичныхДенежныхСредств"))
					И ПолучитьФункциональнуюОпцию("ИспользоватьЗаявкиНаРасходованиеДенежныхСредств")
				//++ Локализация
				//-- Локализация
			)
		Тогда
			Параметры.КонтрольныеРегистрыИзменений.Добавить(Метаданные.РегистрыНакопления.ДенежныеСредстваКВыплате);
		КонецЕсли;
		
		Если ТипЗнч(Документ) = Тип("ДокументОбъект.ЗаявкаНаРасходованиеДенежныхСредств")
			И Документ.Статус <> Перечисления.СтатусыЗаявокНаРасходованиеДенежныхСредств.Отклонена
			И Свойства.РежимЗаписи = РежимЗаписиДокумента.Проведение
			И Не Документ.СверхЛимита Тогда
			Если ПолучитьФункциональнуюОпцию("КонтролироватьПревышениеЛимитовРасходаДенежныхСредств") Тогда
				Параметры.КонтрольныеРегистрыИзменений.Добавить(Метаданные.РегистрыНакопления.ЛимитыРасходаДенежныхСредств);
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Параметры;
	
КонецФункции

// Процедура формирования движений по подчиненным регистрам планирования и контроля денежных средств.
//
// Параметры:
//	ТаблицыДляДвижений - Структура - таблицы данных документа
//	Движения - КоллекцияДвижений - коллекция наборов записей движений документа
//	Отказ - Булево - признак отказа от проведения документа.
//
Процедура ОтразитьДвижения(ТаблицыДляДвижений, Движения, Отказ) Экспорт
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ПроведениеДокументов.ОтразитьДвижения(ТаблицыДляДвижений, Движения, "ДенежныеСредстваКВыплате");
	ПроведениеДокументов.ОтразитьДвижения(ТаблицыДляДвижений, Движения, "ЛимитыРасходаДенежныхСредств");
	
КонецПроцедуры

// Формирует тексты запросов для контроля изменений записанных движений регистров.
//
// Параметры:
//  Запрос - Запрос - запрос, хранящий параметры используемые в списке запросов
//  ТекстыЗапроса - СписокЗначений - список текстов запросов и их имен.
//  Документ - ДокументОбъект - записываемый документ.
//
Процедура ИнициализироватьДанныеКонтроляИзменений(Запрос, ТекстыЗапроса, Документ) Экспорт
	
	#Область ДенежныеСредстваКВыплате
	
	Если ПроведениеДокументов.ЕстьЗаписиВТаблице(Документ, "ДвиженияДенежныеСредстваКВыплатеИзменение") Тогда
		
		ТекстЗапроса =
			"ВЫБРАТЬ
			|	ТаблицаОстатков.ЗаявкаНаРасходованиеДенежныхСредств КАК ЗаявкаНаРасходованиеДенежныхСредств,
			|	ТаблицаОстатков.БанковскийСчетКасса                 КАК БанковскийСчетКасса,
			|	ТаблицаОстатков.Получатель                          КАК Получатель,
			|	ТаблицаОстатков.Организация                         КАК Организация,
			|	ТаблицаОстатков.СуммаОстаток                        КАК Сумма,
			|
			|	Заявка.Организация                                  КАК ОрганизацияЗаявки,
			|	ВЫБОР КОГДА Заявка.ХозяйственнаяОперация В (
			|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаДенежныхСредствПодотчетнику),
			|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВыдачаЗаймаСотруднику)
			|	) ТОГДА
			|		Заявка.ПодотчетноеЛицо
			|	КОГДА Заявка.ХозяйственнаяОперация В (
			|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ОплатаДенежныхСредствВДругуюОрганизацию),
			|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВозвратДенежныхСредствВДругуюОрганизацию),
			|		ЗНАЧЕНИЕ(Перечисление.ХозяйственныеОперации.ВнутренняяПередачаДенежныхСредств)
			|	) ТОГДА
			|		Заявка.ОрганизацияПолучатель
			|	ИНАЧЕ
			|		Заявка.Контрагент
			|	КОНЕЦ                                               КАК ПолучательЗаявки,
			|	Заявка.Валюта                                       КАК Валюта,
			|	Заявка.ХозяйственнаяОперация                        КАК ХозяйственнаяОперация
			|
			|ИЗ
			|	РегистрНакопления.ДенежныеСредстваКВыплате.Остатки(,
			|		(ЗаявкаНаРасходованиеДенежныхСредств, БанковскийСчетКасса, Получатель, Организация) В
			|		(ВЫБРАТЬ
			|			Таблица.ЗаявкаНаРасходованиеДенежныхСредств,
			|			Таблица.БанковскийСчетКасса,
			|			Таблица.Получатель,
			|			Таблица.Организация
			|		ИЗ
			|			ДвиженияДенежныеСредстваКВыплатеИзменение КАК Таблица)
			|		) КАК ТаблицаОстатков
			|
			|	ЛЕВОЕ СОЕДИНЕНИЕ
			|		Документ.ЗаявкаНаРасходованиеДенежныхСредств КАК Заявка
			|	ПО
			|		ТаблицаОстатков.ЗаявкаНаРасходованиеДенежныхСредств = Заявка.Ссылка
			|
			|ГДЕ
			|	ТаблицаОстатков.СуммаОстаток < 0";
		
		ТекстыЗапроса.Добавить(ТекстЗапроса, "ОшибкиДенежныеСредстваКВыплате");
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область ЛимитыРасходаДенежныхСредств
	
	Если ПроведениеДокументов.ЕстьЗаписиВТаблице(Документ, "ДвиженияЛимитыРасходаДенежныхСредствИзменение") Тогда
		
		ТекстыЗапроса.Добавить(
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ЛимитыРасхода.Ссылка.МоментВремени КАК МоментВремени,
			|	ЛимитыРасхода.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
			|	ЛимитыРасхода.ЕстьЛимит КАК ЕстьЛимит
			|ПОМЕСТИТЬ ВременнаяТаблицаСтатьиДДС
			|ИЗ
			|	Документ.ЛимитыРасходаДенежныхСредств.Лимиты КАК ЛимитыРасхода
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ДвиженияЛимитыРасходаДенежныхСредствИзменение КАК Таблица
			|		ПО (ЛимитыРасхода.Ссылка.Организация = Таблица.Организация
			|				ИЛИ НЕ &ИспользоватьЛимитыРасходаДенежныхСредствПоОрганизациям)
			|			И (ЛимитыРасхода.Ссылка.Подразделение = Таблица.Подразделение
			|				ИЛИ НЕ &ИспользоватьЛимитыРасходаДенежныхСредствПоПодразделениям)
			|			И ЛимитыРасхода.СтатьяДвиженияДенежныхСредств = Таблица.СтатьяДвиженияДенежныхСредств
			|ГДЕ
			|	&КонтролироватьПревышениеЛимитовРасходаДенежныхСредств
			|	И НЕ Таблица.СтатьяДвиженияДенежныхСредств ЕСТЬ NULL
			|	И ЛимитыРасхода.Ссылка.Период МЕЖДУ НАЧАЛОПЕРИОДА(&ПериодЛимитаРасходаДС, МЕСЯЦ) И КОНЕЦПЕРИОДА(&ПериодЛимитаРасходаДС, МЕСЯЦ)
			|	И ЛимитыРасхода.Ссылка.Проведен");
		
		ТекстыЗапроса.Добавить(
			"ВЫБРАТЬ
			|	ВременнаяТаблицаСтатьиДДС.СтатьяДвиженияДенежныхСредств
			|ПОМЕСТИТЬ ВременнаяТаблицаСтатьиДДСЛимитНеОграничен
			|ИЗ
			|	ВременнаяТаблицаСтатьиДДС КАК ВременнаяТаблицаСтатьиДДС
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСтатьиДДС КАК Отбор
			|		ПО ВременнаяТаблицаСтатьиДДС.СтатьяДвиженияДенежныхСредств = Отбор.СтатьяДвиженияДенежныхСредств
			|			И ВременнаяТаблицаСтатьиДДС.МоментВремени < Отбор.МоментВремени
			|ГДЕ
			|	Отбор.МоментВремени ЕСТЬ NULL
			|	И НЕ ВременнаяТаблицаСтатьиДДС.ЕстьЛимит");
		
		ТекстыЗапроса.Добавить(
			"ВЫБРАТЬ
			|	Таблица.СтатьяДвиженияДенежныхСредств,
			|	Таблица.Организация,
			|	Таблица.Подразделение
			|ПОМЕСТИТЬ ИзмененияЛимитов
			|ИЗ
			|	ДвиженияЛимитыРасходаДенежныхСредствИзменение КАК Таблица
			|		ЛЕВОЕ СОЕДИНЕНИЕ ВременнаяТаблицаСтатьиДДСЛимитНеОграничен КАК СтатьиДДСЛимитНеОграничен
			|		ПО Таблица.СтатьяДвиженияДенежныхСредств = СтатьиДДСЛимитНеОграничен.СтатьяДвиженияДенежныхСредств
			|ГДЕ
			|	СтатьиДДСЛимитНеОграничен.СтатьяДвиженияДенежныхСредств ЕСТЬ NULL
			|	И Таблица.СтатьяДвиженияДенежныхСредств <> ЗНАЧЕНИЕ(Справочник.СтатьиДвиженияДенежныхСредств.ПустаяСсылка)");
		
		ТекстЗапроса =
			"ВЫБРАТЬ РАЗРЕШЕННЫЕ
			|	ТаблицаОборотов.СтатьяДвиженияДенежныхСредств КАК СтатьяДвиженияДенежныхСредств,
			|	ТаблицаОборотов.Организация КАК Организация,
			|	ТаблицаОборотов.Подразделение КАК Подразделение,
			|	ТаблицаОборотов.РасходВПределахЛимитаОборот - ТаблицаОборотов.ЛимитОборот КАК ПревышениеЛимита
			|ИЗ
			|	РегистрНакопления.ЛимитыРасходаДенежныхСредств.Обороты(
			|			НАЧАЛОПЕРИОДА(&ПериодЛимитаРасходаДС, МЕСЯЦ),
			|			КОНЕЦПЕРИОДА(&ПериодЛимитаРасходаДС, МЕСЯЦ),
			|			,
			|			(СтатьяДвиженияДенежныхСредств, Организация, Подразделение) В
			|				(ВЫБРАТЬ
			|					ИзмененияЛимитов.СтатьяДвиженияДенежныхСредств,
			|					ИзмененияЛимитов.Организация,
			|					ИзмененияЛимитов.Подразделение
			|				ИЗ
			|					ИзмененияЛимитов)) КАК ТаблицаОборотов
			|ГДЕ
			|	&КонтролироватьПревышениеЛимитовРасходаДенежныхСредств
			|	И ТаблицаОборотов.РасходВПределахЛимитаОборот - ТаблицаОборотов.ЛимитОборот > 0";
		
		Если ЗначениеЗаполнено(Документ.ДатаПлатежа) Тогда
			Период = Документ.ДатаПлатежа;
		ИначеЕсли ЗначениеЗаполнено(Документ.ЖелательнаяДатаПлатежа) Тогда
			Период = Документ.ЖелательнаяДатаПлатежа;
		Иначе
			Период = Документ.Дата;
		КонецЕсли;
		
		Запрос.УстановитьПараметр("ПериодЛимитаРасходаДС", Период);
		Запрос.УстановитьПараметр("ИспользоватьЛимитыРасходаДенежныхСредствПоОрганизациям",
			ПолучитьФункциональнуюОпцию("ИспользоватьЛимитыРасходаДенежныхСредствПоОрганизациям"));
		Запрос.УстановитьПараметр("ИспользоватьЛимитыРасходаДенежныхСредствПоПодразделениям",
			ПолучитьФункциональнуюОпцию("ИспользоватьЛимитыРасходаДенежныхСредствПоПодразделениям"));
		Запрос.УстановитьПараметр("КонтролироватьПревышениеЛимитовРасходаДенежныхСредств",
			ПолучитьФункциональнуюОпцию("КонтролироватьПревышениеЛимитовРасходаДенежныхСредств"));
		
		ТекстыЗапроса.Добавить(ТекстЗапроса, "ОшибкиЛимитыРасходаДенежныхСредств");
		
	КонецЕсли;
	
	#КонецОбласти
	
КонецПроцедуры

// Выводит сообщения пользователю при наличии ошибок контроля изменений записанных движений регистров.
//
// Параметры:
//  РезультатыКонтроля - Структура - таблицы с результатами контроля изменений
//  Документ - ДокументОбъект - записываемый документ
//  Отказ - Булево - признак отказа от проведения документа.
//
Процедура СообщитьОРезультатахКонтроляИзменений(РезультатыКонтроля, Документ, Отказ) Экспорт
	
	#Область ДенежныеСредстваКВыплате
	
	Если ПроведениеДокументов.ЕстьЗаписиВТаблице(Документ, "ДвиженияДенежныеСредстваКВыплатеИзменение") Тогда
		
		ЕстьРасхожденияРеквизитов = Ложь;
		
		Для каждого СтрокаОшибки Из РезультатыКонтроля.ОшибкиДенежныеСредстваКВыплате Цикл
			
			ТекстСообщения = "";
			ЭтоЗаявкаНаРасходованиеДС =
				ТипЗнч(СтрокаОшибки.ЗаявкаНаРасходованиеДенежныхСредств) = Тип("ДокументСсылка.ЗаявкаНаРасходованиеДенежныхСредств");
			
			Если ЭтоЗаявкаНаРасходованиеДС И СтрокаОшибки.Организация <> СтрокаОшибки.ОрганизацияЗаявки Тогда
				
				ТекстСообщения = СтрШаблон(НСтр("ru='Организация %1 в документе оплаты не соответствует организации %2 в заявке';uk='Організація %1 в документі оплати не відповідає організації %2 у заявці'"),
					СтрокаОшибки.Организация, СтрокаОшибки.ОрганизацияЗаявки);
				ЕстьРасхожденияРеквизитов = Истина;
			КонецЕсли;
			
			Если ЭтоЗаявкаНаРасходованиеДС И СтрокаОшибки.Получатель <> СтрокаОшибки.ПолучательЗаявки
				И СтрокаОшибки.ХозяйственнаяОперация <> Перечисления.ХозяйственныеОперации.ВыплатаЗарплаты Тогда
				
				ТекстСообщения = ТекстСообщения + ?(Не ПустаяСтрока(ТекстСообщения), Символы.ПС, "")
					+ СтрШаблон(НСтр("ru='Получатель %1 в документе оплаты не соответствует получателю %2 в заявке';uk='Одержувач %1 в документі оплати не відповідає одержувачу %2 в заявці'"),
						СтрокаОшибки.Получатель, СтрокаОшибки.ПолучательЗаявки);
				ЕстьРасхожденияРеквизитов = Истина;
			КонецЕсли;
			
			Если Не ЕстьРасхожденияРеквизитов Тогда
				Если ЭтоЗаявкаНаРасходованиеДС Тогда
					
					ТекстСообщения = СтрШаблон(НСтр("ru='По заявке %1 оплачено больше, чем утверждено в заявке, на %2 %3';uk='За заявкою %1 оплачено більше, ніж затверджено у заявці, на %2 %3'"),
						СтрокаОшибки.ЗаявкаНаРасходованиеДенежныхСредств, -СтрокаОшибки.Сумма, СтрокаОшибки.Валюта);
				Иначе
					
					ТекстСообщения = СтрШаблон(НСтр("ru='По документу %1 оплачено больше, чем утверждено в распоряжении, на %2 %3';uk='За документом %1 оплачено більше, ніж затверджено у розпорядженні, на %2 %3'"),
						СтрокаОшибки.ЗаявкаНаРасходованиеДенежныхСредств, -СтрокаОшибки.Сумма, СтрокаОшибки.Валюта);
				КонецЕсли;
			КонецЕсли;
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Документ, ,, Отказ);
			
			Если ЕстьРасхожденияРеквизитов Тогда
				Прервать;
			КонецЕсли;
			
		КонецЦикла;
		
	КонецЕсли;
	
	#КонецОбласти
	
	#Область ЛимитыРасходаДенежныхСредств
	
	Если ПроведениеДокументов.ЕстьЗаписиВТаблице(Документ, "ДвиженияЛимитыРасходаДенежныхСредствИзменение") Тогда
		
		ШаблонСообщения = НСтр("ru='Превышен лимит расхода по статье %1 на сумму %2 %3';uk='Перевищено ліміт витрачання за статтею %1 на суму %2 %3'");
		ВалютаУправленческогоУчета = Константы.ВалютаУправленческогоУчета.Получить();
		
		Для каждого СтрокаОшибки Из РезультатыКонтроля.ОшибкиЛимитыРасходаДенежныхСредств Цикл
			
			ТекстСообщения = СтрШаблон(ШаблонСообщения, СтрокаОшибки.СтатьяДвиженияДенежныхСредств,
				СтрокаОшибки.ПревышениеЛимита, ВалютаУправленческогоУчета);
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения, Документ);
			
		КонецЦикла;
		
		Если ЗначениеЗаполнено(РезультатыКонтроля.ОшибкиЛимитыРасходаДенежныхСредств)
			И Не Документ.СверхЛимита
			И ПолучитьФункциональнуюОпцию("КонтролироватьПревышениеЛимитовРасходаДенежныхСредств") Тогда
			Отказ = Истина;
		КонецЕсли;
		
	КонецЕсли;
	
	#КонецОбласти
	
КонецПроцедуры


#КонецОбласти


#КонецОбласти

#Область СлужебныеПроцедурыИФункции


#КонецОбласти
